# Homebrew dependencies for MagCat
# brew bundle installs missing packages and upgrades outdated ones automatically

brew "git"
brew "git-lfs"
brew "gh"
# Lets GPG read its passphrase from the macOS login Keychain (wired up in
# install.sh) so commit signing works in headless/background sessions instead of
# timing out on a terminal-only pinentry prompt.
brew "pinentry-mac"
brew "xcodes"
brew "aria2"
brew "rbenv"
brew "ruby-build"
brew "carthage"
brew "shfmt"
brew "terminal-notifier"
brew "gemini-cli"

# Casks
cask "xcodes-app"
cask "gpg-suite-no-mail"
cask "macdown"
cask "db-browser-for-sqlite"
cask "claude-code"
cask "codex"
